package week4;


public class Week4_1 {
/**
 * B - 장애인에게 도움을 줄 수 있는 어플리케이션

 ㄴ 학습영상제공

 ㄴ 장애인, 비장애인, 관리자 별 권한 다르게

 ㄴ 안스, 학습콘텐츠와 정보 제공

 ㄴ 목표 권한위해 DB사용 / 등록은 비장애인,관리자

 ㄴ 영상시청은 모두

 ㄴ 랜덤함수로 문제 랜덤출력

 ㄴ 자바 사용한 모바일 어플

 ㄴ 접근권한 분할 / 게시판을 카테고리별로 구분 / 봉사점수 줌(스크립트 낭독 or 수화영상)

 ㄴ 교수님 曰 장애별 여러개 하지말고 하나만 하는것도 빡셀듯



 C - 자바를 이용한 게임 프로그램

 ㄴ ex) 슈퍼마리오 or 템플런

 ㄴ 학업 또는 노동으로 인한 스트레스 해소

 ㄴ 직접 움직이기

 ㄴ 스토리 넣기

 ㄴ 교수님 曰 기존에 있는 소스를 가져와서 추가 변경 삭제 해라

 ㄴ 장애물도있고 피하는거 / 디자인 잘해라 / 점수가 달라지면 어케 한다는가 추가해라



 D - 맛집 웨이팅 예약 앱 제작

 ㄴ 로그인/ 리스트 제공/ 예약시스템 제공

 ㄴ 안스/ 자바

 ㄴ 회원가입/로그인/마이페이지

 ㄴ 안스DB에 정보 저장

 ㄴ 맛집 리스트와 정보 제공

 ㄴ 날짜와 시간 (원할때) 예약 가능

 ㄴ 교수님 曰 가지않고 예약하는건 식당입장에서 생각해야됨 식당이 기대할 수 있는 기대효과

 ㄴ 식당입장에서 어떠한 기대효과가 있을까 그것을 운영하기 위해서 부담해야할 것은 어떤것이 있는가?

 E - 게임

 ㄴ 적을 피해서 필드를 탐험

 ㄴ 키 아이템을 얻고 레벨 클리어

 ㄴ 자바로 함 스트레스 해소 킬링타임용 아케이드 게임

 ㄴ 필드 어드밴쳐 캐릭터 키아이템

 ㄴ 교수님 曰 기존에 있는 소스를 가져와서 추가 변경 삭제 해라



 G - 배달비 공구 홈페이지

 ㄴ 회원가입/ 로그인 기능에 대한 DB설계

 ㄴ 게시판 및 게시판 내 카테고리 설정, 검색기능 구현

 ㄴ 게시글 내 모집 표시를 통해서 최대 몇 명까지 모집하는지 모집이 완료되었는지 알 수 있는 모집 현황 표시 구현

 ㄴ 배달 공동 오픈채팅방 유출로인해 사생활이 노출되어 불편했음

 ㄴ GPS연동을 통해 주변 사용자끼리만 만남

 ㄴ 로그인아웃회원가입

 ㄴ 지도연동 게시물 작성 수정 삭제

 ㄴ 교수님 曰 유출된 것이 무엇인가 ? 사람들을 매칭시키는 것이 중요하다 / 그 기능이 게시물로 될까 ?

 ㄴ 웹에서 GPS 가능 ? 우리들이 GPS 쓸순없을것이다. / 시간 장소 음식종류 사람문제



 H - 지하철 연착 시각적 확인 프로그램

 ㄴ 지하철 시위로 인해 불편을 겪어서 만들었음

 ㄴ 실시간 지하철 위치를 기반 계산

 ㄴ 지하철 시간표 DB연동 /

 ㄴ OPENAPI사용 브라우저별(반응형) 웹페이지 구성

 ㄴ 역사안에서 얻을 수 없는 정보를 실시간으로 받아보자함

 ㄴ 스크립트로 위치 받아옴 위치와 시각표 차이 계산 프로그램 개발

 ㄴ GIT활용 / 특정구간만 구현 / 출발/도착 선택

 ㄴ 교수님 曰 계산과정에서의 변수 / 계산하는 알고리즘 어떻게 해야할까 ? / 열차 연착의 근거를 어떻게 확보할건지 ?

 ㄴ 변수가 연착에 ㅇㅓ떤 영향을 끼치는가 ?



 I - 학생 관리 프로그램

 ㄴ 로그인 / CURD / 관리자가 관리

 ㄴ 교수님 曰 어떤걸 수강했는지 관심사는 뭔지 진로는 뭔지 이런게 들어가면 좋겠다(상담용으로 사용)

 ㄴ 초기데이터는 어떻게 넣을것인지 ?



 */

}